chenyurong22/STM32-EC200-Firmware/src/modem.c
/* set false when PDP_OPEN is entered; set true when AT+QICSGP is sent from
 * Modem_Process (after the RX buffer is drained) so we never mistake the
 * trailing OK of AT+CGREG? for QICSGP's OK.                                */
static bool qicsgp_sent = false;

/* set false when PDP_ACTIVATE is entered; set true when AT+QIACT=1 is sent
 * from Modem_Process (after the RX buffer is drained) so we never mistake
 * stale OK responses from AT+QMTCLOSE/AT+QIDEACT for QIACT's OK.          */
static bool qiact_sent = false;

/* set true on first AT+QIACT=1 ERROR so the handler force-deactivates and
 * retries once before falling back to NET_WAIT.  Reset on PDP_ACTIVATE entry
 * and on success.  Fixes the post-OTA loop: QIDEACT may silently fail in
 * Modem_Init if HTTP is still closing, leaving the PDP context active.
 * EC200U returns ERROR (not OK) when AT+QIACT=1 is sent on an already-active
 * context, which previously caused an infinite NET_WAIT/PDP loop.           */
static bool qiact_retry_done = false;

/* set true when +QMTOPEN: 0,"hostname",port URC arrives (TLS handshake
 * started).  Success fires only on the subsequent OK (TLS complete).     */
static bool qmtopen_tls_seen = false;
/* Set when unsolicited modem reboot URCs are seen (RDY/+CFUN: 1) so
 * Modem_Process can run a full Modem_Init() re-initialization. */
static bool modem_reinit_pending = false;

static bool ota_retry_blocked(void)
{
    return ((int32_t)(HAL_GetTick() - ota_retry_block_until) < 0);
}

static void modem_log_reset_flags(uint32_t csr)
{
    char flags[128];
    flags[0] = '\0';
#ifdef RCC_CSR_LPWRRSTF
    if (csr & RCC_CSR_LPWRRSTF) strcat(flags, " LPWR");
#endif
#ifdef RCC_CSR_WWDGRSTF
    if (csr & RCC_CSR_WWDGRSTF) strcat(flags, " WWDG");
#endif
#ifdef RCC_CSR_IWDGRSTF
    if (csr & RCC_CSR_IWDGRSTF) strcat(flags, " IWDG");
#endif
#ifdef RCC_CSR_SFTRSTF
    if (csr & RCC_CSR_SFTRSTF) strcat(flags, " SFTRST");
#endif
#ifdef RCC_CSR_PORRSTF
    if (csr & RCC_CSR_PORRSTF) strcat(flags, " POR");
#endif
#ifdef RCC_CSR_PINRSTF
    if (csr & RCC_CSR_PINRSTF) strcat(flags, " PIN");
#endif
#ifdef RCC_CSR_BORRSTF
    if (csr & RCC_CSR_BORRSTF) strcat(flags, " BOR");
#endif
    if (flags[0] == '\0') strcpy(flags, " <none>");
    {
        char dbg[160];
        snprintf(dbg, sizeof(dbg), "[MODEM] Reset flags:%s\r\n", flags);
        Debug_Print(dbg);
    }
}


/* ═══════════════════════════════════════════════════════════════════════════
 * Low-level UART helpers
 * ═══════════════════════════════════════════════════════════════════════════ */

void Modem_Send(const char *cmd)
{
    if (!modem_uart || !cmd)
        return;
    HAL_UART_Transmit(modem_uart, (const uint8_t *)cmd, strlen(cmd), 2000);
}

static void modem_cmd(const char *cmd)
{
    Modem_Send(cmd);
    Modem_Send("\r\n");
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Diagnostic blink  — N × 80 ms pulses on Relay1 (PA5), saves & restores.
 * Used to indicate MQTT progress without needing a UART adapter.
 *   blink_n(1) = QMTOPEN TCP connected (sent AT+QMTCONN)
 *   blink_n(2) = publish confirmed (broker ACK / OK received)
 *   blink_n(3) = MQTT fully connected (subscribed)  ← SUCCESS
 *   blink_n(4) = AT+QMTPUBEX command sent (publish attempted)
 *   blink_n(5) = QMTCONN REFUSED  ← wrong credentials / broker rejected
 *   blink_n(6) = QMTCONN ERROR    ← AT command layer error
 *   blink_n(7) = server dropped connection (+QMTSTAT received)
 * ═══════════════════════════════════════════════════════════════════════════ */

/* ═══════════════════════════════════════════════════════════════════════════
 * Relay control
 * ═══════════════════════════════════════════════════════════════════════════ */

/* Latching relay via transistor (HIGH = transistor ON = coil energised):
 *   Pump1: PA1 → SET coil, PB3 → RESET coil
 *   Pump2: PB4 → SET coil, PB5 → RESET coil
 * Pulse HIGH 200 ms to latch; relay holds position without power */

void Relay1_Set(bool on)
{
    relay1 = on;
    if (on) {
        HAL_GPIO_WritePin(Relay_Pin_GPIO_Port,  Relay_Pin_Pin,  GPIO_PIN_SET);   /* PB3 HIGH — SET coil pulse start  */
        HAL_Delay(200);
        HAL_GPIO_WritePin(Relay_Pin_GPIO_Port,  Relay_Pin_Pin,  GPIO_PIN_RESET); /* PB3 LOW  — SET coil pulse end    */
    } else {
        HAL_GPIO_WritePin(Relay1_RST_GPIO_Port, Relay1_RST_Pin, GPIO_PIN_SET);   /* PA1 HIGH — RESET coil pulse start */
        HAL_Delay(200);
        HAL_GPIO_WritePin(Relay1_RST_GPIO_Port, Relay1_RST_Pin, GPIO_PIN_RESET); /* PA1 LOW  — RESET coil pulse end   */
    }
}

void Relay2_Set(bool on)
{
    relay2 = on;
    if (on) {
        HAL_GPIO_WritePin(Relay2_Pin_GPIO_Port, Relay2_Pin_Pin, GPIO_PIN_SET);   /* PB4 HIGH — SET coil pulse start  */
        HAL_Delay(200);
        HAL_GPIO_WritePin(Relay2_Pin_GPIO_Port, Relay2_Pin_Pin, GPIO_PIN_RESET); /* PB4 LOW  — SET coil pulse end    */
    } else {
        HAL_GPIO_WritePin(Relay2_RST_GPIO_Port, Relay2_RST_Pin, GPIO_PIN_SET);   /* PB5 HIGH — RESET coil pulse start */
        HAL_Delay(200);
        HAL_GPIO_WritePin(Relay2_RST_GPIO_Port, Relay2_RST_Pin, GPIO_PIN_RESET); /* PB5 LOW  — RESET coil pulse end   */
    }
}

static void blink_n(int n)
{
    /* PA1 is now RESET coil — cannot use for diagnostic blink (would unlatch relay) */
    (void)n;
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Network RTC helpers
 * ═══════════════════════════════════════════════════════════════════════════ */

static bool rtc_is_leap(int y)
{
    return (y % 4 == 0 && y % 100 != 0) || (y % 400 == 0);
}

/* Days before each month in a non-leap year */
static const uint16_t k_mdays[12] = {0,31,59,90,120,151,181,212,243,273,304,334};

/* Convert AT+CCLK fields to UTC Unix milliseconds.
 * yy     : 2-digit year (e.g. 26 → 2026)
 * tz_qh  : timezone offset in quarter-hours (+22 = IST +5:30) */
static uint64_t cclk_to_unix_ms(int yy, int mo, int dd,
                                 int hh, int mm, int ss, int tz_qh)
{
    int year = 2000 + yy;
    /* Days from 1970-01-01 to year-01-01 using proleptic Gregorian calendar */
    int y = year - 1;
    long days = (long)y * 365L + (long)(y / 4) - (long)(y / 100) + (long)(y / 400)
              - 719162L; /* pre-computed offset for 1969: 1969*365+492-19+4 */
    /* Days within the year */
    days += k_mdays[mo - 1];
    if (mo > 2 && rtc_is_leap(year)) days++;
    days += dd - 1;
    /* Local seconds since epoch, then subtract tz offset to get UTC */
    int64_t utc_s = (int64_t)days * 86400LL
                  + (int64_t)hh * 3600LL + (int64_t)mm * 60LL + (int64_t)ss
                  - (int64_t)tz_qh * 15LL * 60LL;
    return (uint64_t)(utc_s * 1000LL);
}

/* Parse "+CCLK: \"26/05/21,10:30:00+22\"" and update rtc_unix_ms */
static void parse_cclk_line(const char *line)
{
    const char *p = strstr(line, "+CCLK:");
    if (!p) return;
    p += 6;
    while (*p == ' ') p++;
    if (*p == '"') p++;
    int yy = 0, mo = 0, dd = 0, hh = 0, mm = 0, ss = 0, tz = 0;
    if (sscanf(p, "%d/%d/%d,%d:%d:%d%d", &yy, &mo, &dd, &hh, &mm, &ss, &tz) < 6)
        return;
    if (yy < 24 || mo < 1 || mo > 12 || dd < 1 || dd > 31) return; /* sanity */
    rtc_unix_ms   = cclk_to_unix_ms(yy, mo, dd, hh, mm, ss, tz);
    rtc_tick_base = HAL_GetTick();
    last_cclk_ms  = rtc_tick_base;
    Debug_Print("[RTC] Network time synced\r\n");
}

/* Public getter — returns 0 until first sync */
uint64_t Modem_GetUnixMs(void)
{
    if (!rtc_unix_ms) return 0;
    return rtc_unix_ms + (uint64_t)(HAL_GetTick() - rtc_tick_base);
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Connection status
 * ═══════════════════════════════════════════════════════════════════════════ */

