chenyurong22/STM32-EC200-Firmware/src/modem.c
bool Modem_IsConnected(void)
{
    return mqtt_state == MQTT_STATE_CONNECTED;
}

bool Relay1_Get(void) { return relay1; }
bool Relay2_Get(void) { return relay2; }

/* ═══════════════════════════════════════════════════════════════════════════
 * Sensor stubs
 * Override these in a separate sensors.c once you wire up ADC channels.
 * Until then they return safe dummy values so the MQTT loop works.
 * ═══════════════════════════════════════════════════════════════════════════ */

__attribute__((weak)) float Sensor_ReadVoltagePhase1(void) { return 415.0f; }
__attribute__((weak)) float Sensor_ReadVoltagePhase2(void) { return 415.0f; }
__attribute__((weak)) float Sensor_ReadVoltagePhase3(void) { return 415.0f; }
__attribute__((weak)) float Sensor_ReadCurrentACS712(void) { return 5.0f; }

/* ═══════════════════════════════════════════════════════════════════════════
 * MQTT publish helpers
 * ═══════════════════════════════════════════════════════════════════════════ */

static void queue_publish(const char *topic, const char *payload)
{
    if (pub_pending)
        return; /* drop if previous not sent yet      */

    strncpy(pub_topic, topic, sizeof(pub_topic) - 1);
    strncpy(pub_payload, payload, sizeof(pub_payload) - 1);
    pub_topic[sizeof(pub_topic) - 1] = '\0';
    pub_payload[sizeof(pub_payload) - 1] = '\0';
    pub_pending = true;
}

/* Format float to 1 decimal place without requiring -u_printf_float.
 * Handles negative values and clamps out-of-range to "0.0".           */
static void fmt_f1(char *out, int sz, float v)
{
    if (v != v || v > 99999.0f || v < -9999.0f) { snprintf(out, sz, "0.0"); return; }
    int neg = (v < 0.0f);
    float a = neg ? -v : v;
    int   w = (int)a;
    int   d = (int)((a - (float)w) * 10.0f);
    if (neg) snprintf(out, sz, "-%d.%d",  w, d);
    else     snprintf(out, sz,  "%d.%d",  w, d);
}

static void fmt_f2(char *out, int sz, float v)
{
    if (v != v || v > 9999.0f || v < -999.0f) { snprintf(out, sz, "0.00"); return; }
    int neg = (v < 0.0f);
    float a = neg ? -v : v;
    int   w = (int)a;
    int   d = (int)((a - (float)w) * 100.0f);
    if (neg) snprintf(out, sz, "-%d.%02d", w, d);
    else     snprintf(out, sz,  "%d.%02d", w, d);
}

static void publish_status(void)
{
    float v1 = Sensor_ReadVoltagePhase1();
    float v2 = Sensor_ReadVoltagePhase2();
    float v3 = Sensor_ReadVoltagePhase3();
    float i  = Sensor_ReadCurrentACS712();

    char sv1[12], sv2[12], sv3[12], sci[12], skw[10];
    fmt_f1(sv1, sizeof(sv1), v1);
    fmt_f1(sv2, sizeof(sv2), v2);
    fmt_f1(sv3, sizeof(sv3), v3);
    fmt_f2(sci, sizeof(sci), i);
    fmt_f2(skw, sizeof(skw), Modbus_GetKW());

    char scfg_ov[10], scfg_uv[10], scfg_pl[10], scfg_dry_i[10], scfg_dry_i2[10];
    fmt_f1(scfg_ov,    sizeof(scfg_ov),    cfg_ov);
    fmt_f1(scfg_uv,    sizeof(scfg_uv),    cfg_uv);
    fmt_f1(scfg_pl,    sizeof(scfg_pl),    cfg_pl);
    fmt_f2(scfg_dry_i, sizeof(scfg_dry_i), cfg_dry_i);
    fmt_f2(scfg_dry_i2,sizeof(scfg_dry_i2),cfg_dry_i2);

    bool data_ok   = Modbus_IsDataValid();
    bool r1_running = relay1 && data_ok && (i > cfg_dry_i);
    bool r2_running = relay2 && data_ok && (i > cfg_dry_i2); /* relay2 uses its own threshold */

    int r3 = LoRa_GetRelay3State();  /* -1=unknown, 0=OFF, 1=ON */
    int r4 = LoRa_GetRelay4State();

    char payload[720];
    snprintf(payload, sizeof(payload),
             "{\"relay1_state\":%d,\"relay2_state\":%d,"
             "\"relay1_running\":%d,\"relay2_running\":%d,"
             "\"relay3_state\":%d,\"relay4_state\":%d,"
             "\"v1\":%s,\"v2\":%s,\"v3\":%s,"
             "\"current\":%s,\"kw\":%s,"
             "\"dry_run\":%s,\"dry_run2\":%s,\"online\":true,"
             "\"mb_ok\":%d,\"mb_rx\":%d,\"rssi\":%d,\"boot_phase\":%u,"
             "\"fw\":\"%s\","
             "\"cfg_ov\":%s,\"cfg_uv\":%s,\"cfg_pl\":%s,"
             "\"cfg_dry_i\":%s,\"cfg_dry_t\":%d,\"cfg_start_t\":%d,\"cfg_hp\":%d,\"cfg_dry_en\":%d,"
             "\"cfg_dry_i2\":%s,\"cfg_dry_t2\":%d,\"cfg_start_t2\":%d,\"cfg_hp2\":%d,\"cfg_dry_en2\":%d,"
             "\"cfg_uv_rst_t\":%d}",
             relay1 ? 1 : 0,
             relay2 ? 1 : 0,
             r1_running ? 1 : 0,
             r2_running ? 1 : 0,
             r3, r4,
             sv1, sv2, sv3, sci, skw,
             dry_run_tripped  ? "true" : "false",
             dry_run_tripped2 ? "true" : "false",
             data_ok ? 1 : 0,
             (int)Modbus_GetLastRx(),
             (int)last_rssi,
             (unsigned)g_boot_phase,
             g_fw_ver,
             scfg_ov, scfg_uv, scfg_pl,
             scfg_dry_i, cfg_dry_t, cfg_start_t, cfg_hp, cfg_dry_en,
             scfg_dry_i2, cfg_dry_t2, cfg_start_t2, cfg_hp2, cfg_dry_en2,
             cfg_uv_restart_t);

    queue_publish(TOPIC_STATUS, payload);
}

static void publish_status2(void)
{
    /* pump02 status — relay1_state maps to physical relay2 (PB4/PB5) */
    char payload[48];
    snprintf(payload, sizeof(payload),
             "{\"relay1_state\":%d,\"online\":true}",
             relay2 ? 1 : 0);
    queue_publish(TOPIC_STATUS2, payload);
}

static void publish_alert(bool ov, bool uv, bool pl, bool dr)
{
    char payload[128];
    snprintf(payload, sizeof(payload),
             "{\"overvoltage\":%s,\"undervoltage\":%s,"
             "\"phase_loss\":%s,\"dry_run_trip\":%s}",
             ov ? "true" : "false",
             uv ? "true" : "false",
             pl ? "true" : "false",
             dr ? "true" : "false");

    queue_publish(TOPIC_ALERTS, payload);
}

static void publish_alert2(bool ov, bool uv, bool pl, bool dr)
{
    char payload[128];
    snprintf(payload, sizeof(payload),
             "{\"overvoltage\":%s,\"undervoltage\":%s,"
             "\"phase_loss\":%s,\"dry_run_trip\":%s}",
             ov ? "true" : "false",
             uv ? "true" : "false",
             pl ? "true" : "false",
             dr ? "true" : "false");
    queue_publish(TOPIC_ALERTS2, payload);
}

static void RelayState_Save(void); /* forward declaration */

/* ═══════════════════════════════════════════════════════════════════════════
 * Relay log — publishes on/off events to TOPIC_LOG
 * ═══════════════════════════════════════════════════════════════════════════ */

static void log_relay_event(int relay_num, bool on, const char *reason)
{
    char payload[128];
    uint32_t *on_tick   = (relay_num == 2) ? &relay2_on_tick        : &relay1_on_tick;
    uint32_t *accum     = (relay_num == 2) ? &run_accum2_ms         : &run_accum1_ms;
    uint32_t *last_tk   = (relay_num == 2) ? &last_r2_run_tick      : &last_r1_run_tick;
    uint32_t *saved_ms  = (relay_num == 2) ? &run_accum2_saved_ms   : &run_accum1_saved_ms;
    uint64_t ts_ms = Modem_GetUnixMs(); /* 0 until network time synced */
    if (on) {
        *on_tick   = HAL_GetTick();
        *accum     = 0;   /* reset accumulator for new run session */
        *last_tk   = 0;
        *saved_ms  = 0;
        if (ts_ms)
            snprintf(payload, sizeof(payload),
                     "{\"event\":\"on\",\"reason\":\"%s\",\"relay\":%d,\"ts\":%llu}",
                     reason, relay_num, (unsigned long long)ts_ms);
        else
            snprintf(payload, sizeof(payload),
                     "{\"event\":\"on\",\"reason\":\"%s\",\"relay\":%d}", reason, relay_num);
    } else {
        /* run_s = total confirmed-running time this session.
         * Accumulator only increments when current > threshold, so preventer
         * OFF gaps (current=0) are excluded from the run time. */
        uint32_t run_s = *accum / 1000;
        *on_tick  = 0;
        *accum    = 0;
        *last_tk  = 0;
        if (ts_ms)
            snprintf(payload, sizeof(payload),
                     "{\"event\":\"off\",\"reason\":\"%s\",\"run_s\":%lu,\"relay\":%d,\"ts\":%llu}",
                     reason, (unsigned long)run_s, relay_num, (unsigned long long)ts_ms);
        else
            snprintf(payload, sizeof(payload),
                     "{\"event\":\"off\",\"reason\":\"%s\",\"run_s\":%lu,\"relay\":%d}",
                     reason, (unsigned long)run_s, relay_num);
    }
    queue_publish((relay_num == 2) ? TOPIC_LOG2 : TOPIC_LOG, payload);
    RelayState_Save();
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Protection logic  — called every 1 s when connected
 * ═══════════════════════════════════════════════════════════════════════════ */

static bool is_volt_fault(void)
{
    float v1 = Sensor_ReadVoltagePhase1();
    float v2 = Sensor_ReadVoltagePhase2();
    float v3 = Sensor_ReadVoltagePhase3();
    return (v1 > cfg_ov || v2 > cfg_ov || v3 > cfg_ov) ||
           (v1 < cfg_uv || v2 < cfg_uv || v3 < cfg_uv) ||
           (v1 < cfg_pl || v2 < cfg_pl || v3 < cfg_pl);
}

