chenyurong22/STM32-EC200-Firmware/src/modem.c
static void run_protection(void)
{
    static bool prev_r1_running = false;
    static bool prev_r2_running = false;

    float v1 = Sensor_ReadVoltagePhase1();
    float v2 = Sensor_ReadVoltagePhase2();
    float v3 = Sensor_ReadVoltagePhase3();
    float i = Sensor_ReadCurrentACS712();

    bool ov = (v1 > cfg_ov || v2 > cfg_ov || v3 > cfg_ov);
    bool uv = (v1 < cfg_uv || v2 < cfg_uv || v3 < cfg_uv);
    bool pl = (v1 < cfg_pl || v2 < cfg_pl || v3 < cfg_pl);

    /* Startup grace windows — computed once, reused for both voltage and dry-run suppression.
     * During the grace window UV+PL are ignored: motor inrush can briefly dip the supply.
     * OV protection stays active at all times (overvoltage during startup is dangerous). */
    bool relay1_in_startup = relay1_on_tick &&
        (HAL_GetTick() - relay1_on_tick < (uint32_t)cfg_start_t * 1000U);
    bool relay2_in_startup = relay2_on_tick &&
        (HAL_GetTick() - relay2_on_tick < (uint32_t)cfg_start_t2 * 1000U);

    /* OV always trips.  UV+PL only trip once the startup grace window has expired. */
    bool volt_trip1 = ov || (!relay1_in_startup && (uv || pl));
    bool volt_trip2 = ov || (!relay2_in_startup && (uv || pl));

    if (volt_trip1 && relay1)
    {
        Relay1_Set(false);
        /* Mark UV/PL trip for auto-restart — OV is dangerous, never auto-restart */
        if (!ov) { uv_pl_tripped1 = true; uv_cleared_ms1 = 0; }
        log_relay_event(1, false, ov ? "overvoltage" : (uv ? "undervoltage" : "phase_loss"));
        publish_alert(ov, uv, pl, false);
        volt_alert_sent1 = true;
        Debug_Print("[PROT] Voltage fault — pump1 OFF\r\n");
    }

    if (volt_trip2 && relay2)
    {
        Relay2_Set(false);
        if (!ov) { uv_pl_tripped2 = true; uv_cleared_ms2 = 0; }
        log_relay_event(2, false, ov ? "overvoltage" : (uv ? "undervoltage" : "phase_loss"));
        publish_alert2(ov, uv, pl, false);
        volt_alert_sent2 = true;
        Debug_Print("[PROT] Voltage fault — pump2 OFF\r\n");
    }

    /* If UV/PL dips again while we're waiting to auto-restart, reset the
     * recovery timer so the N-second count restarts from the next clear. */
    if ((uv || pl) && !ov) {
        if (uv_pl_tripped1 && uv_cleared_ms1) { uv_cleared_ms1 = 0; }
        if (uv_pl_tripped2 && uv_cleared_ms2) { uv_cleared_ms2 = 0; }
    }

    if ((ov || uv || pl) && (relay1 || relay2))
        return;

    /* Voltage OK — clear alerts and handle UV/PL auto-restart */
    if (!ov && !uv && !pl)
    {
        if (volt_alert_sent1) {
            volt_alert_sent1 = false;
            publish_alert(false, false, false, false);
            Debug_Print("[PROT] Voltage fault cleared — pump1 alert reset\r\n");
        }
        if (volt_alert_sent2) {
            volt_alert_sent2 = false;
            publish_alert2(false, false, false, false);
            Debug_Print("[PROT] Voltage fault cleared — pump2 alert reset\r\n");
        }

        /* ── UV/PL auto-restart ─────────────────────────────────────────────
         * If relay was tripped by UV/PL (not OV) and cfg_uv_restart_t > 0,
         * wait N seconds after voltage recovers then restart automatically. */
        if (uv_pl_tripped1) {
            if (relay1) {
                /* Relay was manually restarted — cancel auto-restart */
                uv_pl_tripped1 = false; uv_cleared_ms1 = 0;
            } else if (cfg_uv_restart_t > 0) {
                if (uv_cleared_ms1 == 0) {
                    uv_cleared_ms1 = HAL_GetTick();
                    Debug_Print("[PROT] UV/PL cleared — auto-restart timer started\r\n");
                } else if (!dry_run_tripped &&
                           HAL_GetTick() - uv_cleared_ms1 >= (uint32_t)cfg_uv_restart_t * 1000U) {
                    uv_pl_tripped1 = false; uv_cleared_ms1 = 0;
                    Relay1_Set(true);
                    log_relay_event(1, true, "uv_restart");
                    Debug_Print("[PROT] UV/PL auto-restart — pump1 ON\r\n");
                }
            } else {
                /* Auto-restart disabled — clear flag so it doesn't linger */
                uv_pl_tripped1 = false; uv_cleared_ms1 = 0;
            }
        }

        if (uv_pl_tripped2) {
            if (relay2) {
                uv_pl_tripped2 = false; uv_cleared_ms2 = 0;
            } else if (cfg_uv_restart_t > 0) {
                if (uv_cleared_ms2 == 0) {
                    uv_cleared_ms2 = HAL_GetTick();
                    Debug_Print("[PROT] UV/PL cleared — auto-restart timer started (pump2)\r\n");
                } else if (!dry_run_tripped2 &&
                           HAL_GetTick() - uv_cleared_ms2 >= (uint32_t)cfg_uv_restart_t * 1000U) {
                    uv_pl_tripped2 = false; uv_cleared_ms2 = 0;
                    Relay2_Set(true);
                    log_relay_event(2, true, "uv_restart");
                    Debug_Print("[PROT] UV/PL auto-restart — pump2 ON\r\n");
                }
            } else {
                uv_pl_tripped2 = false; uv_cleared_ms2 = 0;
            }
        }
    }

    /* relay1_in_startup already computed above (shared grace window for voltage + dry-run) */
    if (relay1_in_startup)
    {
        dry_run_count = 0; /* keep counter clear during startup grace */
    }
    else if (relay1 && !dry_run_tripped && cfg_dry_en)
    {
        /* i >= DRY_RUN_MIN_I_A: motor is running but drawing low current → dry run.
         * i <  DRY_RUN_MIN_I_A: motor de-energised by external preventer/timer → ignore. */
        if (i >= DRY_RUN_MIN_I_A && i < cfg_dry_i)
        {
            dry_run_count++;
            if (dry_run_count >= (uint8_t)cfg_dry_t)
            {
                dry_run_tripped = true;
                lockout_until = HAL_GetTick() + LOCKOUT_MS;
                Relay1_Set(false);
                log_relay_event(1, false, "dry_run");
                publish_alert(false, false, false, true);
                Debug_Print("[PROT] Dry run — pump OFF + lockout\r\n");
            }
        }
        else
        {
            dry_run_count = 0;
        }
    }

