chenyurong22/STM32-EC200-Firmware/src/modem.c
    if (dry_run_tripped && HAL_GetTick() >= lockout_until)
    {
        dry_run_tripped = false;
        dry_run_count = 0;
        publish_alert(false, false, false, false);
        Debug_Print("[PROT] Lockout cleared\r\n");
    }

    /* ── Relay2 dry run protection ─────────────────────────────────────── */
    /* relay2_in_startup already computed above (shared grace window for voltage + dry-run) */
    if (relay2_in_startup)
    {
        dry_run_count2 = 0;
    }
    else if (relay2 && !dry_run_tripped2 && cfg_dry_en2)
    {
        if (i >= DRY_RUN_MIN_I_A && i < cfg_dry_i2)
        {
            dry_run_count2++;
            if (dry_run_count2 >= (uint8_t)cfg_dry_t2)
            {
                dry_run_tripped2 = true;
                lockout_until2 = HAL_GetTick() + LOCKOUT_MS;
                Relay2_Set(false);
                log_relay_event(2, false, "dry_run");
                publish_alert2(false, false, false, true);
                Debug_Print("[PROT] Dry run2 — pump2 OFF + lockout\r\n");
            }
        }
        else
        {
            dry_run_count2 = 0;
        }
    }

    if (dry_run_tripped2 && HAL_GetTick() >= lockout_until2)
    {
        dry_run_tripped2 = false;
        dry_run_count2 = 0;
        publish_alert2(false, false, false, false);
        Debug_Print("[PROT] Lockout2 cleared\r\n");
    }

    /* Publish immediately when running state changes (relay ON + current confirmed).
     * Without this, STARTING→RUNNING transition waits up to 10s for next heartbeat.
     * run_protection fires every 1s; Modbus updates every 2s — transition seen within 3s. */
    bool data_ok   = Modbus_IsDataValid();
    bool r1_running = relay1 && data_ok && (i > cfg_dry_i);
    bool r2_running = relay2 && data_ok && (i > cfg_dry_i2); /* relay2 uses its own threshold */

    /* Accumulate confirmed-running time — only when current > threshold.
     * Pauses automatically when preventer/timer cuts the contactor (current=0).
     * Resumes when current returns. run_s in the log reflects actual motor
     * running time, not wall-clock time from first detection to relay OFF. */
    uint32_t _now = HAL_GetTick();
    if (r1_running) {
        if (last_r1_run_tick) run_accum1_ms += _now - last_r1_run_tick;
        last_r1_run_tick = _now;
    } else {
        last_r1_run_tick = 0;   /* pause accumulator while motor is stopped */
    }
    if (r2_running) {
        if (last_r2_run_tick) run_accum2_ms += _now - last_r2_run_tick;
        last_r2_run_tick = _now;
    } else {
        last_r2_run_tick = 0;
    }

    /* Persist run_accum to flash every 15 min while a relay is running.
     * On power cut the last saved value is restored in RelayState_Load so
     * at most 15 min of run time is lost.  Saves are skipped when both
     * relays are idle to avoid unnecessary flash wear.                   */
    if ((r1_running && run_accum1_ms - run_accum1_saved_ms >= RUN_SAVE_INTERVAL_MS) ||
        (r2_running && run_accum2_ms - run_accum2_saved_ms >= RUN_SAVE_INTERVAL_MS))
    {
        run_accum1_saved_ms = run_accum1_ms;
        run_accum2_saved_ms = run_accum2_ms;
        RelayState_Save();
    }

    if (r1_running != prev_r1_running)
    {
        prev_r1_running = r1_running;
        publish_status();
    }
    if (r2_running != prev_r2_running)
    {
        prev_r2_running = r2_running;
        publish_status2();
    }
}

/* ═══════════════════════════════════════════════════════════════════════════
 * JSON field extractor  — extracts integer value for a key
 * e.g. extract_int("{\"relay1\":1,\"relay2\":0}", "relay1") → 1
 * ═══════════════════════════════════════════════════════════════════════════ */

static int extract_int(const char *json, const char *key)
{
    char search[32];
    snprintf(search, sizeof(search), "\"%s\":", key);
    const char *p = strstr(json, search);
    if (!p)
        return -1;
    p += strlen(search);
    while (*p == ' ')
        p++;
    return atoi(p);
}

/* ═══════════════════════════════════════════════════════════════════════════
 * JSON float field extractor — returns float value for key, or def if missing
 * ═══════════════════════════════════════════════════════════════════════════ */

/* Lightweight float parser — avoids newlib strtod() bloat (~15 KB).
 * Handles formats like "1.5", "480", "-2.3". */
static float parse_float_lite(const char *s)
{
    while (*s == ' ') s++;
    float sign = 1.0f;
    if (*s == '-') { sign = -1.0f; s++; }
    float result = 0.0f;
    while (*s >= '0' && *s <= '9') { result = result * 10.0f + (*s++ - '0'); }
    if (*s == '.') {
        s++;
        float frac = 0.1f;
        while (*s >= '0' && *s <= '9') { result += (*s++ - '0') * frac; frac *= 0.1f; }
    }
    return sign * result;
}

static float extract_float(const char *json, const char *key, float def)
{
    char search[32];
    snprintf(search, sizeof(search), "\"%s\":", key);
    const char *p = strstr(json, search);
    if (!p) return def;
    p += strlen(search);
    while (*p == ' ') p++;
    return parse_float_lite(p);
}

/* ═══════════════════════════════════════════════════════════════════════════
 * JSON string field extractor — copies value of "key":"<value>" into out
 * Returns true if key was found and value is non-empty.
 * ═══════════════════════════════════════════════════════════════════════════ */

static bool extract_str(const char *json, const char *key, char *out, size_t max)
{
    char search[40];
    snprintf(search, sizeof(search), "\"%s\":\"", key);
    const char *p = strstr(json, search);
    if (!p) return false;
    p += strlen(search);
    size_t i = 0;
    while (*p && *p != '"' && i < max - 1)
        out[i++] = *p++;
    out[i] = '\0';
    return (i > 0);
}

/* Accept OTA trigger payloads in either format:
 *   {"url":"https://..."}   or   https://...
 * Extract URL from any line containing http/https text. */
static bool extract_ota_url_any(const char *text, char *out, size_t max)
{
    const char *p = strstr(text, "https://");
    if (!p) p = strstr(text, "http://");
    if (!p) return false;

    size_t i = 0;
    while (*p && i < max - 1) {
        char c = *p;
        if (c == '"' || c == ',' || c == ' ' || c == '\r' || c == '\n')
            break;
        out[i++] = c;
        p++;
    }
    out[i] = '\0';
    return (i > 0);
}

static void modem_ota_start(const char *url); /* forward declaration */
static void modem_ota_publish(const char *topic, const char *payload); /* forward declaration */
static void modem_lora_ota_publish(const char *topic, const char *payload); /* forward declaration */
static bool modem_is_exact_reboot_urc(const char *line);

/* ── Relay state persistence (Flash page 31 = 0x0800F800, 2KB) ──────────────
 * Saves relay1/relay2 ON/OFF state so a power-cycle reboot restores the
 * physical latching-relay position correctly instead of defaulting to OFF. */
#define RELAY_STATE_MAGIC  0xFEED5A5CU  /* bumped: struct now includes run_accum */
#define RELAY_STATE_ADDR   0x0800F800U
#define RELAY_STATE_PAGE   31U

