chenyurong22/STM32-EC200-Firmware/src/modem.c
    /* Collect response lines: +CMGR header, body text, then OK */
    char sender[24] = "";
    char body[80]   = "";
    int  hdr_seen   = 0;
    char lbuf[128];
    size_t lpos = 0;
    uint32_t t0 = HAL_GetTick();

    while (HAL_GetTick() - t0 < 5000)
    {
        uint8_t b;
        IWDG->KR = 0xAAAAU;
        if (HAL_UART_Receive(modem_uart, &b, 1, 50) != HAL_OK)
            continue;
        if (b == '\r') continue;
        if (b == '\n')
        {
            lbuf[lpos] = '\0';
            if (lpos > 0)
            {
                if (strstr(lbuf, "+CMGR:"))
                {
                    /* Extract sender: +CMGR: "REC UNREAD","+91XXXX","","date" */
                    const char *q = strchr(lbuf, '"');   /* open " of status   */
                    if (q) { q = strchr(q + 1, '"'); }   /* close " of status  */
                    if (q) { q = strchr(q + 1, '"'); }   /* open " of number   */
                    if (q)
                    {
                        q++;
                        const char *q2 = strchr(q, '"');
                        if (q2)
                        {
                            size_t n = (size_t)(q2 - q);
                            if (n < sizeof(sender)) { memcpy(sender, q, n); sender[n] = '\0'; }
                        }
                    }
                    hdr_seen = 1;
                }
                else if (hdr_seen == 1)
                {
                    strncpy(body, lbuf, sizeof(body) - 1);
                    body[sizeof(body) - 1] = '\0';
                    hdr_seen = 2;
                }
                else if (strcmp(lbuf, "OK") == 0)
                    break;
            }
            lpos = 0;
        }
        else
        {
            if (lpos < sizeof(lbuf) - 1) lbuf[lpos++] = (char)b;
        }
    }

    /* Delete the message right away so storage doesn't fill up */
    char del[24];
    snprintf(del, sizeof(del), "AT+CMGD=%d", sms_index);
    modem_cmd(del);
    HAL_Delay(300);
    IWDG->KR = 0xAAAAU;

    /* Trim trailing whitespace from body */
    size_t bl = strlen(body);
    while (bl > 0 && (body[bl - 1] == ' ' || body[bl - 1] == '\r' || body[bl - 1] == '\n'))
        body[--bl] = '\0';

    if (sender[0] == '\0' || body[0] == '\0')
    {
        Debug_Print("[SMS] Failed to parse SMS — ignored\r\n");
        return;
    }

    {
        char dbg[80];
        snprintf(dbg, sizeof(dbg), "[SMS] From=%s Body=%s\r\n", sender, body);
        Debug_Print(dbg);
    }

    /* Trusted-number filter: if SMS_TRUSTED_NUMBER is set (non-empty) and
     * sender doesn't match, drop the message.  When the macro is "" the
     * compiler folds SMS_TRUSTED_NUMBER[0]=='\0' to true and removes the
     * block entirely.                                                       */
    if (SMS_TRUSTED_NUMBER[0] != '\0' && strcmp(sender, SMS_TRUSTED_NUMBER) != 0)
    {
        Debug_Print("[SMS] Untrusted sender — ignored\r\n");
        return;
    }

    /* Upper-case body for keyword matching */
    char body_up[sizeof(body)];
    for (size_t i = 0; i < sizeof(body); i++)
    {
        char ch = body[i];
        body_up[i] = (char)((ch >= 'a' && ch <= 'z') ? ch - 32 : ch);
        if (body_up[i] == '\0') break;
    }

    if (strstr(body_up, "STATUS"))
    {
        uint32_t r1s = run_accum1_ms / 1000;
        uint32_t r2s = run_accum2_ms / 1000;
        bool mqtt_ok = (mqtt_state == MQTT_STATE_CONNECTED   ||
                        mqtt_state == MQTT_STATE_PUBLISHING  ||
                        mqtt_state == MQTT_STATE_PUB_WAIT_OK);
        char reply[160];
        snprintf(reply, sizeof(reply),
                 "P%s/P%s R1:%s R2:%s RT1:%luh%02lum RT2:%luh%02lum MQTT:%s",
                 PUMP_ID, PUMP_ID2,
                 relay1 ? "ON" : "OFF",
                 relay2 ? "ON" : "OFF",
                 (unsigned long)(r1s / 3600), (unsigned long)((r1s % 3600) / 60),
                 (unsigned long)(r2s / 3600), (unsigned long)((r2s % 3600) / 60),
                 mqtt_ok ? "OK" : "NO");
        sms_reply(sender, reply);
    }
    else if (strstr(body_up, "PUMP1 ON"))
    {
        if (relay2)
            sms_reply(sender, "P1 ON BLOCKED: P2 active");
        else if (is_volt_fault())
            sms_reply(sender, "P1 ON BLOCKED: volt fault");
        else if (HAL_GetTick() < lockout_until)
            sms_reply(sender, "P1 ON BLOCKED: lockout");
        else
        {
            bool prev1 = relay1;
            Relay1_Set(true);
            if (relay1 != prev1) { log_relay_event(1, true,  "sms"); publish_status(); }
            sms_reply(sender, relay1 ? "P1: ON" : "P1 ON failed");
        }
    }
    else if (strstr(body_up, "PUMP1 OFF"))
    {
        bool prev1 = relay1;
        Relay1_Set(false);
        if (relay1 != prev1) { log_relay_event(1, false, "sms"); publish_status(); }
        sms_reply(sender, "P1: OFF");
    }
    else if (strstr(body_up, "PUMP2 ON"))
    {
        if (relay1)
            sms_reply(sender, "P2 ON BLOCKED: P1 active");
        else if (is_volt_fault())
            sms_reply(sender, "P2 ON BLOCKED: volt fault");
        else if (HAL_GetTick() < lockout_until2)
            sms_reply(sender, "P2 ON BLOCKED: lockout");
        else
        {
            bool prev2 = relay2;
            Relay2_Set(true);
            if (relay2 != prev2) { log_relay_event(2, true,  "sms"); publish_status2(); }
            sms_reply(sender, relay2 ? "P2: ON" : "P2 ON failed");
        }
    }
    else if (strstr(body_up, "PUMP2 OFF"))
    {
        bool prev2 = relay2;
        Relay2_Set(false);
        if (relay2 != prev2) { log_relay_event(2, false, "sms"); publish_status2(); }
        sms_reply(sender, "P2: OFF");
    }
    else if (strstr(body_up, "RESET"))
    {
        sms_reply(sender, "Resetting...");
        for (int i = 0; i < 4; i++) { HAL_Delay(500); IWDG->KR = 0xAAAAU; }
        NVIC_SystemReset();
    }
    else
    {
        sms_reply(sender, "Cmds: STATUS PUMP1 ON PUMP1 OFF PUMP2 ON PUMP2 OFF RESET");
    }
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Line processor — called for every complete line received from EC200U
 * ═══════════════════════════════════════════════════════════════════════════ */

