chenyurong22/STM32-EC200-Firmware/src/modem.c
    /* ── PHASE 1: everything done while MQTT is still connected ──────────────
     *
     * Key insight: AT+QHTTPURL only stores the URL in RAM — it does NOT start
     * a TLS handshake or any network activity.  The TLS/TCP connection only
     * happens later during AT+QHTTPGET.
     *
     * By doing SSL config, QHTTPCFG, and QHTTPURL while MQTT is connected, any
     * failure (ERROR / timeout) can be published to Firebase immediately via the
     * live MQTT connection — no reconnect cycle needed.
     *
     * AT+QHTTPGET is the only command that cannot coexist with MQTT TLS
     * (EC200U cannot run two simultaneous TLS sessions), so MQTT disconnect
     * is deferred until just before AT+QHTTPGET.                            */

    /* Publish "starting" — tells bridge.js to clear the retained OTA message
     * on pump/01/ota so the board doesn't re-trigger OTA on every reconnect. */
    /* Publish "starting" even if a status heartbeat is mid-flight.
     * The retained pump/01/ota message often arrives while mqtt_state is
     * PUBLISHING or PUB_WAIT_OK (connection heartbeat queued immediately on
     * CONNECTED).  Wait 700 ms for the in-progress publish to complete, then
     * flush stale modem bytes before sending our own AT+QMTPUBEX.            */
    if (mqtt_state == MQTT_STATE_CONNECTED   ||
        mqtt_state == MQTT_STATE_PUBLISHING  ||
        mqtt_state == MQTT_STATE_PUB_WAIT_OK ||
        mqtt_state == MQTT_STATE_SUBSCRIBING) {
        /* Retained OTA URL often arrives while AT+QMTSUB is still in progress
         * (broker delivers retained messages during subscription processing).
         * Wait 1500 ms: enough for subscribe to complete + any in-flight
         * heartbeat publish to finish before we send AT+QMTPUBEX.           */
        HAL_Delay(1500);
        HAL_IWDG_Refresh(&hiwdg);
        { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 50) == HAL_OK) {} }

        const char *ota_payload = "{\"ota_status\":\"starting\"}";
        char pub_cmd[80];
        snprintf(pub_cmd, sizeof(pub_cmd),
                 "AT+QMTPUBEX=0,0,0,0,\"" TOPIC_OTA_STATUS "\",%d",
                 (int)strlen(ota_payload));
        modem_cmd(pub_cmd);
        uint8_t c;
        uint32_t t0 = HAL_GetTick();
        bool got_prompt = false;
        while (HAL_GetTick() - t0 < 3000) {
            if (HAL_UART_Receive(modem_uart, &c, 1, 5) == HAL_OK && c == '>') {
                got_prompt = true; break;
            }
        }
        if (got_prompt) {
            HAL_UART_Transmit(modem_uart, (uint8_t*)ota_payload,
                              strlen(ota_payload), 1000);
            uint8_t ctrlz = 0x1A;  /* Ctrl-Z commits the MQTT publish */
            HAL_UART_Transmit(modem_uart, &ctrlz, 1, 1000);
            HAL_Delay(500);        /* wait for modem to process publish */
            /* Flush +QMTPUBEX response so it doesn't interfere with SSL cmds */
            { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 50) == HAL_OK) {} }

            /* Self-clear the retained OTA message on pump/XX/ota so the
             * device does NOT re-trigger OTA on the next reconnect even if
             * the bridge misses the "starting" status.
             * Publish empty payload + retain=1 → broker deletes the retained.
             * NOTE: msgid MUST be 0 when qos=0 (EC200U rejects qos=1,msgid=0
             * with ERROR and never shows the > prompt — silent failure). */
            char clr_cmd[80];
            snprintf(clr_cmd, sizeof(clr_cmd),
                     "AT+QMTPUBEX=0,0,0,1,\"%s\",0", TOPIC_OTA);
            modem_cmd(clr_cmd);
            bool clr_prompt = false;
            t0 = HAL_GetTick();
            while (HAL_GetTick() - t0 < 3000) {
                if (HAL_UART_Receive(modem_uart, &c, 1, 5) == HAL_OK && c == '>') {
                    clr_prompt = true; break;
                }
            }
            if (clr_prompt) {
                ctrlz = 0x1A;
                HAL_UART_Transmit(modem_uart, &ctrlz, 1, 500); /* 0-byte payload */
                HAL_Delay(300);
                { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 50) == HAL_OK) {} }
                Debug_Print("[OTA] Retained OTA topic self-cleared\r\n");
            }
        }
        HAL_IWDG_Refresh(&hiwdg);
    }

    /* Arm OTA cooldown NOW — before phase 2 CFUN — so that if phase 2 fails
     * and MQTT reconnects, the retained URL cannot re-trigger OTA immediately.
     * Without this, any early phase-2 failure caused an instant retry loop:
     * MQTT reconnect → retained URL → modem_ota_start → CFUN → fail → repeat. */
    ota_retry_block_until = HAL_GetTick() + OTA_RETRY_BLOCK_MS;
    Debug_Print("[OTA] Cooldown armed at OTA start\r\n");

    /* SSL context 1 — used by HTTP client (independent of context 0 = MQTT).
     * Re-applied here because AT+QIDEACT (from a previous reconnect) resets
     * QSSLCFG RAM settings.                                                 */
    modem_cmd("AT+QSSLCFG=\"sslversion\",1,4");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QSSLCFG=\"ciphersuite\",1,0xFFFF");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QSSLCFG=\"seclevel\",1,0");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    /* EC200U HTTPS servers behind CDN (e.g., GitHub raw) typically require
     * TLS SNI and can reject handshake when modem RTC is stale. */
    if (have_ota_host) {
        char sni_cmd[160];
        snprintf(sni_cmd, sizeof(sni_cmd), "AT+QSSLCFG=\"sni\",1,\"%s\"", ota_host);
        modem_cmd(sni_cmd);
    } else {
        modem_cmd("AT+QSSLCFG=\"sni\",1,1");
    }
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QSSLCFG=\"ignorelocaltime\",1,1");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QHTTPCFG=\"contextid\",1");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QHTTPCFG=\"sslctxid\",1");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    /* Without "ssl",1 the HTTP client uses plain TCP even for https:// URLs.
     * The TLS handshake never happens and GitHub returns a connection error. */
    modem_cmd("AT+QHTTPCFG=\"ssl\",1");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd(OTA_HTTP_REDIRECT_ENABLED ? "AT+QHTTPCFG=\"redirect\",1"
                                        : "AT+QHTTPCFG=\"redirect\",0");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QHTTPCFG=\"responseheader\",0");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QHTTPCFG=\"requestheader\",0");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);

    /* Stop any lingering HTTP session and delete any leftover file from a
     * previous failed OTA attempt.  AT+QHTTPGET auto-saves the response to
     * "HTTP_GETFILE" on EC200U UFS (no drive prefix).  Delete it first so
     * stale content cannot be flashed if a previous download was incomplete.
     * Errors from both commands are ignored. */
    modem_cmd("AT+QHTTPSTOP");
    HAL_Delay(500);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QFDEL=\"HTTP_GETFILE\"");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 50) == HAL_OK) {} }
    HAL_IWDG_Refresh(&hiwdg);

    /* Set URL.  Use a 5-second input window so the modem exits URL-input mode
     * before modem_sync_expect (10 s) returns — keeps the modem in a clean
     * command-mode state on failure.                                         */
    char urlcmd[32];
    snprintf(urlcmd, sizeof(urlcmd), "AT+QHTTPURL=%d,5", (int)strlen(url));
    modem_cmd(urlcmd);

