chenyurong22/STM32-EC200-Firmware/src/modem.c
/* ── LoRa OTA publish callback — lets lora_ota.c publish via MQTT ──────── */
static void modem_lora_ota_publish(const char *topic, const char *payload)
{
    pub_pending = false;
    queue_publish(topic, payload);
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Modem_Init  — called once from main.c after UART init
 * ═══════════════════════════════════════════════════════════════════════════ */

void Modem_Init(UART_HandleTypeDef *huart)
{
    modem_uart = huart;
    rxpos = 0;
    mqtt_state = MQTT_STATE_BOOT;
    state_entered_ms = HAL_GetTick();

    /* Restore relay state from Flash before anything else — ensures latching
     * relays are driven to match their last known position on every reboot. */
    RelayState_Load();

    Debug_Print("\r\n=== EC200U MQTT Pump Controller ===\r\n");
    Debug_Print("[MODEM] Pump ID : " PUMP_ID "\r\n");
    Debug_Print("[MODEM] Broker  : " BROKER_HOST "\r\n");
    Debug_Print("[MODEM] Waiting for EC200U ready...\r\n");

    /* Detect software reset (NVIC_SystemReset after OTA) vs cold power-on.
     * RCC_CSR_SFTRSTF is set by NVIC_SystemReset; PORRSTF is set on power-on.
     * Used below to choose the initial MQTT state. */
    uint32_t reset_csr = RCC->CSR;
    bool ota_reboot = ((reset_csr & RCC_CSR_SFTRSTF) != 0) && OTA_WasRebootPending();
    {
        char dbg[96];
        snprintf(dbg, sizeof(dbg), "[MODEM] Reset CSR: 0x%08lX\r\n", (unsigned long)reset_csr);
        Debug_Print(dbg);
    }
    modem_log_reset_flags(reset_csr);
    RCC->CSR |= RCC_CSR_RMVF;   /* clear reset-cause flags for next check */

    if (ota_reboot) {
        /* Block OTA retrigger for 5 minutes after an OTA reboot.
         * After ota_reboot, CFUN=1,1 + settle + MQTT connect takes ~3 min.
         * The previous 2-min cooldown expired BEFORE MQTT even connected,
         * so the retained OTA URL triggered an instant re-OTA loop every time.
         * 5 min guarantees the cooldown outlasts MQTT reconnection. */
        ota_retry_block_until = HAL_GetTick() + 300000UL;
        Debug_Print("[OTA] Cooldown armed (5 min) to prevent post-OTA loop\r\n");

        /* Check OTA flags to determine if the bootloader applied the update.
         * Bootloader erases the flags page (all bytes → 0xFF) after a
         * successful App B → App A copy.  If the flags magic is still
         * OTA_MAGIC the bootloader CRC check failed and old App A is kept.  */
        volatile uint32_t *flags_magic = (volatile uint32_t*)OTA_FLAGS_ADDR;
        if (*flags_magic == 0xFFFFFFFFUL) {
            /* Erased flags = bootloader ran + copy succeeded → new firmware */
            strncpy(ota_error_msg, "{\"ota_status\":\"success\"}",
                    sizeof(ota_error_msg) - 1);
            ota_error_msg[sizeof(ota_error_msg) - 1] = '\0';
            Debug_Print("[OTA] New firmware running — will publish success\r\n");
        } else {
            /* Flags still present = bootloader CRC check failed, old App A kept */
            strncpy(ota_error_msg, "{\"ota_status\":\"error\",\"reason\":\"crc_fail\"}",
                    sizeof(ota_error_msg) - 1);
            ota_error_msg[sizeof(ota_error_msg) - 1] = '\0';
            Debug_Print("[OTA] Post-OTA: bootloader CRC fail — old firmware kept\r\n");
        }
        /* AT+QHTTPSTOP does NOT fully free the TLS context-1 heap on the
         * EC200U after an HTTPS OTA download.  Without clearing it,
         * AT+QMTOPEN cannot allocate SSL buffers for MQTT context 0 and
         * MQTT never reconnects after OTA (confirmed: QMTOPEN? returns
         * just "OK" — no active session).  AT+CFUN=1,1 performs a full
         * modem software reset which clears all TLS heap.
         * OTA_IsActive() returns true during OTA_ST_REBOOT so the
         * DISCONNECTED auto-reconnect block cannot fire during cleanup.  */
        Debug_Print("[MODEM] OTA reboot — AT+CFUN=1,1 to clear TLS heap\r\n");
        modem_cmd("AT+CFUN=1,1");
        /* Wait up to 30 s for the "RDY" URC signalling modem restart done.
         * modem_sync_expect() pets IWDG every 1 ms — watchdog safe.       */
        bool rdy_seen = modem_sync_expect("RDY", 30000);
        (void)rdy_seen;
        /* 10 s additional settle: SIM CPIN, partial network registration   */
        for (int i = 0; i < 20; i++) { HAL_Delay(500); IWDG->KR = 0xAAAAU; }
        { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 100) == HAL_OK) {} }
        IWDG->KR = 0xAAAAU;
        Debug_Print("[MODEM] CFUN reset + settle complete\r\n");
    } else {
        /* Cold boot OR non-OTA soft reset (MQTT watchdog, etc.) — just wait
         * for the modem to settle.  CFUN=1,1 is only needed after a true OTA
         * download (TLS heap stuck); applying it on every watchdog reset
         * destabilises the modem and creates an infinite CFUN loop. */
        for (int i = 0; i < 10; i++) { HAL_Delay(500); IWDG->KR = 0xAAAAU; }
    }
    if (!modem_sync_cmd_ok("AT", 2000, 15))
        Debug_Print("[MODEM] WARN: AT sync failed, continuing\r\n");
    if (!modem_sync_cmd_ok("ATE0", 2000, 5))
        Debug_Print("[MODEM] WARN: ATE0 failed, continuing\r\n");
    /* Lock CEREG URC mode to 0 so AT+CEREG? always returns "+CEREG: 0,<stat>".
     * After an OTA reboot the modem may retain mode=1 or 2 from a previous
     * session, changing the response format and preventing NET_WAIT from
     * recognising the registration status.                                   */
    if (!modem_sync_cmd_ok("AT+CEREG=0", 2000, 5))
        Debug_Print("[MODEM] WARN: CEREG mode set failed, continuing\r\n");

    /* SMS text mode, +CMTI URC on new message, clear stored messages */
    modem_cmd("AT+CMGF=1");          /* select text mode                   */
    HAL_Delay(300);
    modem_cmd("AT+CNMI=2,1,0,0,0"); /* route new-SMS URC (+CMTI) to UART  */
    HAL_Delay(300);
    modem_cmd("AT+CMGD=1,4");       /* delete ALL stored messages (clean slate) */
    HAL_Delay(300);
    IWDG->KR = 0xAAAAU;

    /* SSL context 1 — used by HTTP client for HTTPS OTA downloads.
     * Must be separate from context 0 (MQTT) so the broker SNI doesn't
     * interfere with GitHub/CDN TLS handshake.                             */
    modem_cmd("AT+QSSLCFG=\"sslversion\",1,4");
    HAL_Delay(300);
    modem_cmd("AT+QSSLCFG=\"ciphersuite\",1,0xFFFF");
    HAL_Delay(300);
    modem_cmd("AT+QSSLCFG=\"seclevel\",1,0");   /* no cert verify for testing */
    HAL_Delay(300);
    /* HTTP client: use SSL context 1, follow GitHub → CDN redirects */
    modem_cmd("AT+QHTTPCFG=\"sslctxid\",1");
    HAL_Delay(300);
    modem_cmd("AT+QHTTPCFG=\"redirect\",1");
    HAL_Delay(300);

    IWDG->KR = 0xAAAAU;   /* ~3 s elapsed since last pet — refresh before long delays */

