chenyurong22/STM32-EC200-Firmware/src/modem.c
    /* Cancel any lingering HTTP session (may be left over from a failed OTA).
     * Must be done BEFORE AT+QMTCLOSE so the SSL subsystem is fully released. */
    modem_cmd("AT+QHTTPSTOP");
    HAL_Delay(2000);            /* was 500 ms — after OTA the HTTP session needs
                                 * extra time to fully close before QIDEACT.    */
    IWDG->KR = 0xAAAAU;        /* pet: 2 s elapsed since pet before QHTTPSTOP  */

    /* Close any lingering MQTT session and PDP context FIRST.
     * AT+QMTCLOSE reloads NVM MQTT config — so ALL AT+QMTCFG commands must
     * come AFTER this to avoid being overwritten by the NVM reload.          */
    modem_cmd("AT+QMTCLOSE=0");
    HAL_Delay(1500);
    { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 1) == HAL_OK) {} }
    IWDG->KR = 0xAAAAU;   /* pet after QMTCLOSE — 2 s since last pet */
    modem_cmd("AT+QIDEACT=1");
    /* Wait up to 40 s for the PDP context to fully deactivate (Quectel max spec).
     * modem_sync_expect pets IWDG every 1 ms so the watchdog cannot fire.
     * After OTA the modem may take several seconds to tear down the HTTP/TLS
     * session before it can release the PDP bearer — a fixed 2 s delay was not
     * enough, leaving the context ACTIVE and causing QIACT=1 to return ERROR. */
    modem_sync_expect("OK", 40000);
    { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 1) == HAL_OK) {} }
    IWDG->KR = 0xAAAAU;

    /* Re-apply SSL context 0 AFTER QMTCLOSE+QIDEACT.
     * AT+QMTCLOSE reloads NVM MQTT config which may reset QSSLCFG context 0
     * settings (seclevel, ciphersuite, SNI) back to factory defaults.
     * Placing these here guarantees they are set correctly regardless of any
     * NVM reload, and they survive until AT+QMTOPEN is called.              */
    modem_cmd("AT+QSSLCFG=\"sslversion\",0,4");
    HAL_Delay(300);
    modem_cmd("AT+QSSLCFG=\"ciphersuite\",0,0xFFFF");
    HAL_Delay(300);
    modem_cmd("AT+QSSLCFG=\"seclevel\",0,0");   /* no cert verify — EMQX self-signed */
    HAL_Delay(300);
    modem_cmd("AT+QSSLCFG=\"sni\",0,\"" BROKER_HOST "\"");
    HAL_Delay(300);
    IWDG->KR = 0xAAAAU;   /* pet: 4×300 ms = 1.2 s since last pet              */

    /* Configure MQTT client AFTER QMTCLOSE so NVM reload can't undo these.  */
    modem_cmd("AT+QMTCFG=\"ssl\",0,1,0");       /* MQTT client 0 → SSL context 0  */
    HAL_Delay(300);
    /* EC200U NVM default is MQTT 3.1 (version=3) which omits credentials from
     * the CONNECT packet — broker sees anonymous → CONNACK=5.
     * Must explicitly set version=4 (MQTT 3.1.1) AFTER every QMTCLOSE.     */
    modem_cmd("AT+QMTCFG=\"version\",0,4");     /* MQTT 3.1.1 — sends credentials */
    HAL_Delay(300);
    modem_cmd("AT+QMTCFG=\"pdpcid\",0,1");      /* bind to PDP context 1          */
    HAL_Delay(300);
    modem_cmd("AT+QMTCFG=\"keepalive\",0,300"); /* keepalive 300 s — survives OTA */
    HAL_Delay(300);
    modem_cmd("AT+QMTCFG=\"session\",0,1");     /* clean session                  */
    HAL_Delay(300);
    modem_cmd("AT+QMTCFG=\"will\",0,0");        /* disable Will — no stale topic  */
    HAL_Delay(300);
    modem_cmd("AT+QMTCFG=\"recv/mode\",0,1,1"); /* direct push + full payload URC */
    HAL_Delay(300);

    /* Wire up OTA send/publish callbacks so ota.c can issue AT commands
     * and publish MQTT status without a circular header dependency.         */
    OTA_Init();
    OTA_SetSendFn(Modem_Send);
    OTA_SetPublishFn(modem_ota_publish);

    /* Wire up LoRa OTA callbacks (pump03 Blue Pill firmware update over LoRa) */
    LoRaOta_Init();
    LoRaOta_SetSendFn(Modem_Send);
    LoRaOta_SetPublishFn(modem_lora_ota_publish);
    LoRaOta_SetLoRaFn(LoRa_SendRaw);

    /* PDP is now deactivated (modem_sync_expect confirmed OK above).
     * Use the same NET_WAIT path for both cold boot and OTA reboot.
     * NET_WAIT polls CEREG until LTE is registered, then NET_WAIT→PDP_OPEN
     * sends QICSGP to configure the APN — QIACT=1 requires a valid APN
     * context configuration even after a previous QIDEACT.              */
    if (ota_reboot)
        Debug_Print("[MODEM] OTA reboot — PDP deactivated, going to NET_WAIT\r\n");
    mqtt_state       = MQTT_STATE_NET_WAIT;
    state_entered_ms = HAL_GetTick();
    /* Suppress modem_reinit for 20 s after init — late EC200U boot URCs
     * (APP RDY, +CFUN: 1) that arrive during the config phase must not
     * re-trigger a full Modem_Init unnecessarily.                       */
    modem_init_grace_until = HAL_GetTick() + 20000UL;
    modem_boot_ms = HAL_GetTick();   /* start the never-connected watchdog clock */
    modem_cmd("AT+CEREG?");
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Modem_Process  — called every loop iteration from main.c
 * ═══════════════════════════════════════════════════════════════════════════ */

void Modem_Process(void)
{
    if (!modem_uart)
        return;

    /* Keep feeding watchdog even when no UART data arrives. */
    HAL_IWDG_Refresh(&hiwdg);

    /* ── read bytes from EC200U into line buffer ── */
    /* Direct hardware register read — same approach as Modbus RX.
     * Bypasses HAL lock/unlock overhead (~6 µs per call) so the main loop
     * runs at <1 µs/iteration, fast enough to read USART2 Modbus bytes
     * (one every 1040 µs at 9600 baud) without overrun.                  */
    uint8_t c;
    static uint8_t ota_connect_match = 0;
    static bool ota_skip_to_lf = false;
    static uint16_t ota_rx_pet = 0;
    for (;;) {
        uint32_t isr1 = modem_uart->Instance->ISR;
        if (isr1 & (USART_ISR_ORE | USART_ISR_FE | USART_ISR_NE)) {
            modem_uart->Instance->ICR = USART_ICR_ORECF | USART_ICR_FECF | USART_ICR_NECF;
            modem_uart->ErrorCode = HAL_UART_ERROR_NONE;
        }
        if (!(isr1 & USART_ISR_RXNE_RXFNE)) break;
        c = (uint8_t)(modem_uart->Instance->RDR & 0xFF);
        if (++ota_rx_pet >= 64U) { HAL_IWDG_Refresh(&hiwdg); ota_rx_pet = 0; }

        /* Detect prompt-style CONNECT from AT+QHTTPREAD that may arrive without
         * a clean line break. */
        if (OTA_ExpectingHttpReadConnect()) {
            static const char token[] = "CONNECT";
            if (c == (uint8_t)token[ota_connect_match]) {
                ota_connect_match++;
                if (ota_connect_match >= (sizeof(token) - 1U)) {
                    ota_connect_match = 0;
                    ota_skip_to_lf = true;
                    OTA_HandleLine("CONNECT");
                }
                continue;
            }
            ota_connect_match = (c == (uint8_t)token[0]) ? 1U : 0U;
            /* While waiting for CONNECT, keep bytes isolated from line parser. */
            continue;
        } else {
            ota_connect_match = 0;
        }

        /* Drop trailing CONNECT line ending before passing binary bytes to OTA. */
        if (ota_skip_to_lf) {
            if (c == '\n') {
                ota_skip_to_lf = false;
            }
            continue;
        }

