chenyurong22/STM32-EC200-Firmware/src/modem.c
        /* OTA binary passthrough — raw bytes from AT+QFREAD/QHTTPREAD */
        if (OTA_BinaryPending()) {
            OTA_FeedByte(c);
            continue;
        }

        /* LoRa OTA binary passthrough — raw bytes from AT+QFREAD during LoRa OTA */
        if (LoRaOta_BinaryPending()) {
            LoRaOta_FeedByte(c);
            continue;
        }

        if (c == '\r')
            continue;

        /* '>' is the publish prompt — not followed by '\n', catch it here */
                if (c == '>')
        {
            if (mqtt_state == MQTT_STATE_PUBLISHING && pub_pending)
            {
                /* Send payload immediately � any blocking delay here risks
                 * the modem aborting the input window.                     */
                HAL_UART_Transmit(modem_uart,
                                  (uint8_t *)pub_payload, strlen(pub_payload), 3000);
                /* Ctrl-Z commits the message */
                uint8_t ctrlz = 0x1A;
                HAL_UART_Transmit(modem_uart, &ctrlz, 1, 1000);
                mqtt_state = MQTT_STATE_PUB_WAIT_OK;
                state_entered_ms = HAL_GetTick();
            }
            rxpos = 0;
            continue;
        }

        if (c == '\n')
        {
            rxbuf[rxpos] = '\0';
            if (rxpos > 0)
                process_line(rxbuf);
            rxpos = 0;
        }
        else
        {
            if (rxpos < RX_BUF_SIZE - 1)
                rxbuf[rxpos++] = (char)c;
            else
                rxpos = 0; /* overflow guard */
        }
    }

    /* Full modem reset recovery path: re-run Modem_Init so SSL/MQTT config
     * is restored before attempting any reconnect. */
    if (modem_reinit_pending && !OTA_IsActive() && !LoRaOta_IsActive()) {
        modem_reinit_pending   = false;
        recv_payload_pending   = false;
        pub_pending            = false;
        pub_status2_needed     = false;
        OTA_Init();
        Modem_Init(modem_uart);
        return;
    }

    /* ── SMS remote control — works regardless of MQTT connection state ── */
    if (!OTA_IsActive())
        sms_process();

    /* ── send AT+QIACT=1 after buffer is drained (avoids stale QMTCLOSE/QIDEACT OK) ── */
    if (mqtt_state == MQTT_STATE_PDP_ACTIVATE && !qiact_sent)
    {
        qiact_sent = true;
        modem_cmd("AT+QIACT=1");
    }

    /* ── send AT+QICSGP after buffer is drained (avoids spurious CGREG OK) ── */
    if (mqtt_state == MQTT_STATE_PDP_OPEN && !qicsgp_sent)
    {
        qicsgp_sent = true;
        char apn_cmd[80];
        snprintf(apn_cmd, sizeof(apn_cmd),
                 "AT+QICSGP=1,1,\"%s\",\"\",\"\",0", SIM_APN);
        modem_cmd(apn_cmd);
    }

    /* ── BOOT heartbeat: keep probing modem until first RDY/OK is seen ── */
    if (mqtt_state == MQTT_STATE_BOOT &&
        (HAL_GetTick() - state_entered_ms) > 3000U)
    {
        Debug_Print("[MODEM] BOOT probe: AT\r\n");
        modem_cmd("AT");
        state_entered_ms = HAL_GetTick();
    }

    /* ── BROKER_OPEN / CONNECTING / SUBSCRIBING timeouts → reconnect ── */
    if ((mqtt_state == MQTT_STATE_BROKER_OPEN ||
         mqtt_state == MQTT_STATE_CONNECTING  ||
         mqtt_state == MQTT_STATE_SUBSCRIBING) &&
        HAL_GetTick() - state_entered_ms > 30000)
    {
        Debug_Print("[MQTT] Connection timeout — reconnecting\r\n");
        if (mqtt_state == MQTT_STATE_BROKER_OPEN) blink_n(1); /* 1 blink = BROKER_OPEN timed out */
        mqtt_state = MQTT_STATE_DISCONNECTED;
    }

    /* ── PUBLISHING timeout — no '>' within 10s means connection is dead ── */
    if (mqtt_state == MQTT_STATE_PUBLISHING &&
        HAL_GetTick() - state_entered_ms > 10000)
    {
        Debug_Print("[MQTT] Publish timeout — reconnecting\r\n");
        pub_pending = false;
        mqtt_state = MQTT_STATE_DISCONNECTED;
    }

    /* ── PUB_WAIT_OK timeout — if +QMTPUBEX never arrives, back to CONNECTED ── */
    if (mqtt_state == MQTT_STATE_PUB_WAIT_OK &&
        HAL_GetTick() - state_entered_ms > MQTT_PUBACK_TIMEOUT_MS)
    {
        Debug_Print("[MQTT] PubWaitOK timeout — continuing\r\n");
        pub_pending = false;
        mqtt_state = MQTT_STATE_CONNECTED;
    }

    /* ── MQTT connectivity watchdog ─────────────────────────────────────
     * Fires if MQTT has not been connected for > 5 min, measured from
     * whichever is later: last successful connect OR boot completion.
     * Covers two cases:
     *   1. Was connected, then dropped (mqtt_connected_last_ms set).
     *   2. Never connected at all this boot (e.g. TLS heap stuck after
     *      OTA failure) — use modem_boot_ms as fallback reference so the
     *      watchdog still fires and CFUN=1,1 clears the stale TLS state. */
    if (mqtt_state == MQTT_STATE_CONNECTED)
        mqtt_connected_last_ms = HAL_GetTick();
    else if (!OTA_IsActive() && !LoRaOta_IsActive())
    {
        uint32_t ref = mqtt_connected_last_ms ? mqtt_connected_last_ms : modem_boot_ms;
        if (ref && (HAL_GetTick() - ref) > 300000UL)
        {
            Debug_Print("[MQTT] No connection for 5 min — auto reset\r\n");
            HAL_Delay(200);
            NVIC_SystemReset();
        }
    }

    /* ── periodic tasks (only when fully connected) ── */
    if (mqtt_state == MQTT_STATE_CONNECTED && !OTA_IsActive() && !LoRaOta_IsActive())
    {

        /* Network time sync — request AT+CCLK? once after connect, then every 6h */
        if (!pub_pending &&
            (cclk_needed ||
             (last_cclk_ms && HAL_GetTick() - last_cclk_ms >= CCLK_RESYNC_MS)))
        {
            cclk_needed = false;
            modem_cmd("AT+CCLK?");
        }

        /* Deferred pump02 status — send as soon as the queue is free */
        if (pub_status2_needed && !pub_pending)
        {
            pub_status2_needed = false;
            publish_status2();
        }

        /* publish on state change — relay or dry-run trip changed */
        if (!pub_pending &&
            (relay1 != prev_relay1 || relay2 != prev_relay2 ||
             dry_run_tripped != prev_dry_run_trip))
        {
            bool relay2_changed = (relay2 != prev_relay2);
            prev_relay1       = relay1;
            prev_relay2       = relay2;
            prev_dry_run_trip = dry_run_tripped;
            publish_status();
            if (relay2_changed) pub_status2_needed = true; /* deferred — queue busy */
        }

        /* heartbeat every 60 s — keeps Firebase online:true fresh */
        if (HAL_GetTick() - last_heartbeat_ms >= HEARTBEAT_INTERVAL_MS)
        {
            last_heartbeat_ms = HAL_GetTick();
            modem_cmd("AT+CSQ"); /* refresh signal strength; +CSQ updates last_rssi */
            publish_status();
            pub_status2_needed = true; /* deferred — queue busy after publish_status() */
        }

